MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
extern volatile ANCON1bits_t ANCON1bits __at(0xF24);
// bitfield macros
#define _ANCON1_ANSEL8_POSN                                 0x0
#define _ANCON1_ANSEL8_POSITION                             0x0
#define _ANCON1_ANSEL8_SIZE                                 0x1
#define _ANCON1_ANSEL8_LENGTH                               0x1
#define _ANCON1_ANSEL8_MASK                                 0x1
#define _ANCON1_ANSEL9_POSN                                 0x1
#define _ANCON1_ANSEL9_POSITION                             0x1
#define _ANCON1_ANSEL9_SIZE                                 0x1
#define _ANCON1_ANSEL9_LENGTH                               0x1
#define _ANCON1_ANSEL9_MASK                                 0x2
#define _ANCON1_ANSEL10_POSN                                0x2
#define _ANCON1_ANSEL10_POSITION                            0x2
#define _ANCON1_ANSEL10_SIZE                                0x1
#define _ANCON1_ANSEL10_LENGTH                              0x1
#define _ANCON1_ANSEL10_MASK                                0x4
#define _ANCON1_ANSEL11_POSN                                0x3
#define _ANCON1_ANSEL11_POSITION                            0x3
#define _ANCON1_ANSEL11_SIZE                                0x1
#define _ANCON1_ANSEL11_LENGTH                              0x1
#define _ANCON1_ANSEL11_MASK                                0x8
#define _ANCON1_ANSEL12_POSN                                0x4
#define _ANCON1_ANSEL12_POSITION                            0x4
#define _ANCON1_ANSEL12_SIZE                                0x1
#define _ANCON1_ANSEL12_LENGTH                              0x1
#define _ANCON1_ANSEL12_MASK                                0x10
#define _ANCON1_ANSEL13_POSN                                0x5
#define _ANCON1_ANSEL13_POSITION                            0x5
#define _ANCON1_ANSEL13_SIZE                                0x1
#define _ANCON1_ANSEL13_LENGTH                              0x1
#define _ANCON1_ANSEL13_MASK                                0x20
#define _ANCON1_ANSEL14_POSN                                0x6
#define _ANCON1_ANSEL14_POSITION                            0x6
#define _ANCON1_ANSEL14_SIZE                                0x1
#define _ANCON1_ANSEL14_LENGTH                              0x1
#define _ANCON1_ANSEL14_MASK                                0x40
#define _ANCON1_ANSEL15_POSN                                0x7
#define _ANCON1_ANSEL15_POSITION                            0x7
#define _ANCON1_ANSEL15_SIZE                                0x1
#define _ANCON1_ANSEL15_LENGTH                              0x1
#define _ANCON1_ANSEL15_MASK                                0x80
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4
#define _ANCON1_PCFG11_POSN                                 0x3
#define _ANCON1_PCFG11_POSITION                             0x3
#define _ANCON1_PCFG11_SIZE                                 0x1
#define _ANCON1_PCFG11_LENGTH                               0x1
#define _ANCON1_PCFG11_MASK                                 0x8
#define _ANCON1_PCFG12_POSN                                 0x4
#define _ANCON1_PCFG12_POSITION                             0x4
#define _ANCON1_PCFG12_SIZE                                 0x1
#define _ANCON1_PCFG12_LENGTH                               0x1
#define _ANCON1_PCFG12_MASK                                 0x10
#define _ANCON1_PCFG13_POSN                                 0x5
#define _ANCON1_PCFG13_POSITION                             0x5
#define _ANCON1_PCFG13_SIZE                                 0x1
#define _ANCON1_PCFG13_LENGTH                               0x1
#define _ANCON1_PCFG13_MASK                                 0x20
#define _ANCON1_PCFG14_POSN                                 0x6
#define _ANCON1_PCFG14_POSITION                             0x6
#define _ANCON1_PCFG14_SIZE                                 0x1
#define _ANCON1_PCFG14_LENGTH                               0x1
#define _ANCON1_PCFG14_MASK                                 0x40
#define _ANCON1_PCFG15_POSN                                 0x7
#define _ANCON1_PCFG15_POSITION                             0x7
#define _ANCON1_PCFG15_SIZE                                 0x1
#define _ANCON1_PCFG15_LENGTH                               0x1
#define _ANCON1_PCFG15_MASK                                 0x80

// Register: ANCON0
#define ANCON0 ANCON0
extern volatile unsigned char           ANCON0              __at(0xF25);
#ifndef _LIB_BUILD
asm("ANCON0 equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL0                 :1;
        unsigned ANSEL1                 :1;
        unsigned ANSEL2                 :1;
        unsigned ANSEL3                 :1;
        unsigned ANSEL4                 :1;
        unsigned ANSEL5                 :1;
        unsigned ANSEL6                 :1;
        unsigned ANSEL7                 :1;
    };
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
        unsigned PCFG3                  :1;
        unsigned PCFG4                  :1;
        unsigned PCFG5                  :1;
        unsigned PCFG6                  :1;
        unsigned PCFG7                  :1;
    };
} ANCON0bits_t;
extern volatile ANCON0bits_t ANCON0bits __at(0xF25);
// bitfield macros
#define _ANCON0_ANSEL0_POSN                                 0x0
#define _ANCON0_ANSEL0_POSITION                             0x0
#define _ANCON0_ANSEL0_SIZE                                 0x1
#define _ANCON0_ANSEL0_LENGTH                               0x1
#define _ANCON0_ANSEL0_MASK                                 0x1
#define _ANCON0_ANSEL1_POSN                                 0x1
#define _ANCON0_ANSEL1_POSITION                             0x1
#define _ANCON0_ANSEL1_SIZE                                 0x1
#define _ANCON0_ANSEL1_LENGTH                               0x1
#define _ANCON0_ANSEL1_MASK                                 0x2
#define _ANCON0_ANSEL2_POSN                                 0x2
#define _ANCON0_ANSEL2_POSITION                             0x2
#define _ANCON0_ANSEL2_SIZE                                 0x1
#define _ANCON0_ANSEL2_LENGTH                               0x1
#define _ANCON0_ANSEL2_MASK                                 0x4
#define _ANCON0_ANSEL3_POSN                                 0x3
#define _ANCON0_ANSEL3_POSITION                             0x3
#define _ANCON0_ANSEL3_SIZE                                 0x1
#define _ANCON0_ANSEL3_LENGTH                               0x1
#define _ANCON0_ANSEL3_MASK                                 0x8
#define _ANCON0_ANSEL4_POSN                                 0x4
#define _ANCON0_ANSEL4_POSITION                             0x4
#define _ANCON0_ANSEL4_SIZE                                 0x1
#define _ANCON0_ANSEL4_LENGTH                               0x1
#define _ANCON0_ANSEL4_MASK                                 0x10
#define _ANCON0_ANSEL5_POSN                                 0x5
#define _ANCON0_ANSEL5_POSITION                             0x5
#define _ANCON0_ANSEL5_SIZE                                 0x1
#define _ANCON0_ANSEL5_LENGTH                               0x1
#define _ANCON0_ANSEL5_MASK                                 0x20
#define _ANCON0_ANSEL6_POSN                                 0x6
#define _ANCON0_ANSEL6_POSITION                             0x6
#define _ANCON0_ANSEL6_SIZE                                 0x1
#define _ANCON0_ANSEL6_LENGTH                               0x1
#define _ANCON0_ANSEL6_MASK                                 0x40
#define _ANCON0_ANSEL7_POSN                                 0x7
#define _ANCON0_ANSEL7_POSITION                             0x7
#define _ANCON0_ANSEL7_SIZE                                 0x1
#define _ANCON0_ANSEL7_LENGTH                               0x1
#define _ANCON0_ANSEL7_MASK                                 0x80
#define _ANCON0_PCFG0_POSN                                  0x0
#define _ANCON0_PCFG0_POSITION                              0x0
#define _ANCON0_PCFG0_SIZE                                  0x1
#define _ANCON0_PCFG0_LENGTH                                0x1
#define _ANCON0_PCFG0_MASK                                  0x1
#define _ANCON0_PCFG1_POSN                                  0x1
#define _ANCON0_PCFG1_POSITION                              0x1
#define _ANCON0_PCFG1_SIZE                                  0x1
#define _ANCON0_PCFG1_LENGTH                                0x1
#define _ANCON0_PCFG1_MASK                                  0x2
#define _ANCON0_PCFG2_POSN                                  0x2
#define _ANCON0_PCFG2_POSITION                              0x2
#define _ANCON0_PCFG2_SIZE                                  0x1
#define _ANCON0_PCFG2_LENGTH                                0x1
#define _ANCON0_PCFG2_MASK                                  0x4
#define _ANCON0_PCFG3_POSN                                  0x3
#define _ANCON0_PCFG3_POSITION                              0x3
#define _ANCON0_PCFG3_SIZE                                  0x1
#define _ANCON0_PCFG3_LENGTH                                0x1
#define _ANCON0_PCFG3_MASK                                  0x8
#define _ANCON0_PCFG4_POSN                                  0x4
#define _ANCON0_PCFG4_POSITION                              0x4
#define _ANCON0_PCFG4_SIZE                                  0x1
#define _ANCON0_PCFG4_LENGTH                                0x1
#define _ANCON0_PCFG4_MASK                                  0x10
#define _ANCON0_PCFG5_POSN                                  0x5
#define _ANCON0_PCFG5_POSITION                              0x5
#define _ANCON0_PCFG5_SIZE                                  0x1
#define _ANCON0_PCFG5_LENGTH                                0x1
#define _ANCON0_PCFG5_MASK                                  0x20
#define _ANCON0_PCFG6_POSN                                  0x6
#define _ANCON0_PCFG6_POSITION                              0x6
#define _ANCON0_PCFG6_SIZE                                  0x1
#define _ANCON0_PCFG6_LENGTH                                0x1
#define _ANCON0_PCFG6_MASK                                  0x40
#define _ANCON0_PCFG7_POSN                                  0x7
#define _ANCON0_PCFG7_POSITION                              0x7
#define _ANCON0_PCFG7_SIZE                                  0x1
#define _ANCON0_PCFG7_LENGTH                                0x1
#define _ANCON0_PCFG7_MASK                                  0x80

// Register: MEMCON
#define MEMCON MEMCON
extern volatile unsigned char           MEMCON              __at(0xF26);
#ifndef _LIB_BUILD
asm("MEMCON equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WM                     :2;
        unsigned                        :2;
        unsigned WAIT                   :2;
        unsigned                        :1;
        unsigned EBDIS                  :1;
    };
    struct {
        unsigned WM0                    :1;
        unsigned WM1                    :1;
        unsigned                        :2;
        unsigned WAIT0                  :1;
        unsigned WAIT1                  :1;
    };
} MEMCONbits_t;
extern volatile MEMCONbits_t MEMCONbits __at(0xF26);
// bitfield macros
#define _MEMCON_WM_POSN                                     0x0
#define _MEMCON_WM_POSITION                                 0x0
#define _MEMCON_WM_SIZE                                     0x2
#define _MEMCON_WM_LENGTH                                   0x2
#define _MEMCON_WM_MASK                                     0x3
#define _MEMCON_WAIT_POSN                                   0x4
#define _MEMCON_WAIT_POSITION                               0x4
#define _MEMCON_WAIT_SIZE                                   0x2
#define _MEMCON_WAIT_LENGTH                                 0x2
#define _MEMCON_WAIT_MASK                                   0x30
#define _MEMCON_EBDIS_POSN                                  0x7
#define _MEMCON_EBDIS_POSITION                              0x7
#define _MEMCON_EBDIS_SIZE                                  0x1
#define _MEMCON_EBDIS_LENGTH                                0x1
#define _MEMCON_EBDIS_MASK                                  0x80
#define _MEMCON_WM0_POSN                                    0x0
#define _MEMCON_WM0_POSITION                                0x0
#define _MEMCON_WM0_SIZE                                    0x1
#define _MEMCON_WM0_LENGTH                                  0x1
#define _MEMCON_WM0_MASK                                    0x1
#define _MEMCON_WM1_POSN                                    0x1
#define _MEMCON_WM1_POSITION                                0x1
#define _MEMCON_WM1_SIZE                                    0x1
#define _MEMCON_WM1_LENGTH                                  0x1
#define _MEMCON_WM1_MASK                                    0x2
#define _MEMCON_WAIT0_POSN                                  0x4
#define _MEMCON_WAIT0_POSITION                              0x4
#define _MEMCON_WAIT0_SIZE                                  0x1
#define _MEMCON_WAIT0_LENGTH                                0x1
#define _MEMCON_WAIT0_MASK                                  0x10
#define _MEMCON_WAIT1_POSN                                  0x5
#define _MEMCON_WAIT1_POSITION                              0x5
#define _MEMCON_WAIT1_SIZE                                  0x1
#define _MEMCON_WAIT1_LENGTH                                0x1
#define _MEMCON_WAIT1_MASK                                  0x20

// Register: ODCON3
#define ODCON3 ODCON3
extern volatile unsigned char           ODCON3              __at(0xF27);
#ifndef _LIB_BUILD
asm("ODCON3 equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUDS                 :1;
        unsigned                        :5;
        unsigned U1OD                   :1;
        unsigned U2OD                   :1;
    };
} ODCON3bits_t;
extern volatile ODCON3bits_t ODCON3bits __at(0xF27);
// bitfield macros
#define _ODCON3_CTMUDS_POSN                                 0x0
#define _ODCON3_CTMUDS_POSITION                             0x0
#define _ODCON3_CTMUDS_SIZE                                 0x1
#define _ODCON3_CTMUDS_LENGTH                               0x1
#define _ODCON3_CTMUDS_MASK                                 0x1
#define _ODCON3_U1OD_POSN                                   0x6
#define _ODCON3_U1OD_POSITION                               0x6
#define _ODCON3_U1OD_SIZE                                   0x1
#define _ODCON3_U1OD_LENGTH                                 0x1
#define _ODCON3_U1OD_MASK                                   0x40
#define _ODCON3_U2OD_POSN                                   0x7
#define _ODCON3_U2OD_POSITION                               0x7
#define _ODCON3_U2OD_SIZE                                   0x1
#define _ODCON3_U2OD_LENGTH                                 0x1
#define _ODCON3_U2OD_MASK                                   0x80

// Register: ODCON2
#define ODCON2 ODCON2
extern volatile unsigned char           ODCON2              __at(0xF28);
#ifndef _LIB_BUILD
asm("ODCON2 equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3OD                 :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned CCP6OD                 :1;
        unsigned CCP7OD                 :1;
        unsigned CCP8OD                 :1;
        unsigned CCP9OD                 :1;
        unsigned CCP10OD                :1;
    };
} ODCON2bits_t;
extern volatile ODCON2bits_t ODCON2bits __at(0xF28);
// bitfield macros
#define _ODCON2_CCP3OD_POSN                                 0x0
#define _ODCON2_CCP3OD_POSITION                             0x0
#define _ODCON2_CCP3OD_SIZE                                 0x1
#define _ODCON2_CCP3OD_LENGTH                               0x1
#define _ODCON2_CCP3OD_MASK                                 0x1
#define _ODCON2_CCP4OD_POSN                                 0x1
#define _ODCON2_CCP4OD_POSITION                             0x1
#define _ODCON2_CCP4OD_SIZE                                 0x1
#define _ODCON2_CCP4OD_LENGTH                               0x1
#define _ODCON2_CCP4OD_MASK                                 0x2
#define _ODCON2_CCP5OD_POSN                                 0x2
#define _ODCON2_CCP5OD_POSITION                             0x2
#define _ODCON2_CCP5OD_SIZE                                 0x1
#define _ODCON2_CCP5OD_LENGTH                               0x1
#define _ODCON2_CCP5OD_MASK                                 0x4
#define _ODCON2_CCP6OD_POSN                                 0x3
#define _ODCON2_CCP6OD_POSITION                             0x3
#define _ODCON2_CCP6OD_SIZE                                 0x1
#define _ODCON2_CCP6OD_LENGTH                               0x1
#define _ODCON2_CCP6OD_MASK                                 0x8
#define _ODCON2_CCP7OD_POSN                                 0x4
#define _ODCON2_CCP7OD_POSITION                             0x4
#define _ODCON2_CCP7OD_SIZE                                 0x1
#define _ODCON2_CCP7OD_LENGTH                               0x1
#define _ODCON2_CCP7OD_MASK                                 0x10
#define _ODCON2_CCP8OD_POSN                                 0x5
#define _ODCON2_CCP8OD_POSITION                             0x5
#define _ODCON2_CCP8OD_SIZE                                 0x1
#define _ODCON2_CCP8OD_LENGTH                               0x1
#define _ODCON2_CCP8OD_MASK                                 0x20
#define _ODCON2_CCP9OD_POSN                                 0x6
#define _ODCON2_CCP9OD_POSITION                             0x6
#define _ODCON2_CCP9OD_SIZE                                 0x1
#define _ODCON2_CCP9OD_LENGTH                               0x1
#define _ODCON2_CCP9OD_MASK                                 0x40
#define _ODCON2_CCP10OD_POSN                                0x7
#define _ODCON2_CCP10OD_POSITION                            0x7
#define _ODCON2_CCP10OD_SIZE                                0x1
#define _ODCON2_CCP10OD_LENGTH                              0x1
#define _ODCON2_CCP10OD_MASK                                0x80

// Register: ODCON1
#define ODCON1 ODCON1
extern volatile unsigned char           ODCON1              __at(0xF29);
#ifndef _LIB_BUILD
asm("ODCON1 equ 0F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2OD                 :1;
        unsigned                        :4;
        unsigned CCP1OD                 :1;
        unsigned CCP2OD                 :1;
        unsigned SPI1OD                 :1;
    };
} ODCON1bits_t;
extern volatile ODCON1bits_t ODCON1bits __at(0xF29);
// bitfield macros
#define _ODCON1_SPI2OD_POSN                                 0x0
#define _ODCON1_SPI2OD_POSITION                             0x0
#define _ODCON1_SPI2OD_SIZE                                 0x1
#define _ODCON1_SPI2OD_LENGTH                               0x1
#define _ODCON1_SPI2OD_MASK                                 0x1
#define _ODCON1_CCP1OD_POSN                                 0x5
#define _ODCON1_CCP1OD_POSITION                             0x5
#define _ODCON1_CCP1OD_SIZE                                 0x1
#define _ODCON1_CCP1OD_LENGTH                               0x1
#define _ODCON1_CCP1OD_MASK                                 0x20
#define _ODCON1_CCP2OD_POSN                                 0x6
#define _ODCON1_CCP2OD_POSITION                             0x6
#define _ODCON1_CCP2OD_SIZE                                 0x1
#define _ODCON1_CCP2OD_LENGTH                               0x1
#define _ODCON1_CCP2OD_MASK                                 0x40
#define _ODCON1_SPI1OD_POSN                                 0x7
#define _ODCON1_SPI1OD_POSITION                             0x7
#define _ODCON1_SPI1OD_SIZE                                 0x1
#define _ODCON1_SPI1OD_LENGTH                               0x1
#define _ODCON1_SPI1OD_MASK                                 0x80

// Register: REFOCON
#define REFOCON REFOCON
extern volatile unsigned char           REFOCON             __at(0xF2A);
#ifndef _LIB_BUILD
asm("REFOCON equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RODIV                  :4;
        unsigned ROSEL                  :1;
        unsigned ROSSLP                 :1;
        unsigned                        :1;
        unsigned ROON                   :1;
    };
    struct {
        unsigned RODIV0                 :1;
        unsigned RODIV1                 :1;
        unsigned RODIV2                 :1;
        unsigned RODIV3                 :1;
    };
} REFOCONbits_t;
