MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
extern volatile PR12bits_t PR12bits __at(0xF31);
// bitfield macros
#define _PR12_PR12_POSN                                     0x0
#define _PR12_PR12_POSITION                                 0x0
#define _PR12_PR12_SIZE                                     0x8
#define _PR12_PR12_LENGTH                                   0x8
#define _PR12_PR12_MASK                                     0xFF

// Register: TMR12
#define TMR12 TMR12
extern volatile unsigned char           TMR12               __at(0xF32);
#ifndef _LIB_BUILD
asm("TMR12 equ 0F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR12                  :8;
    };
} TMR12bits_t;
extern volatile TMR12bits_t TMR12bits __at(0xF32);
// bitfield macros
#define _TMR12_TMR12_POSN                                   0x0
#define _TMR12_TMR12_POSITION                               0x0
#define _TMR12_TMR12_SIZE                                   0x8
#define _TMR12_TMR12_LENGTH                                 0x8
#define _TMR12_TMR12_MASK                                   0xFF

// Register: T10CON
#define T10CON T10CON
extern volatile unsigned char           T10CON              __at(0xF33);
#ifndef _LIB_BUILD
asm("T10CON equ 0F33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T10CKPS                :2;
        unsigned TMR10ON                :1;
        unsigned T10OUTPS               :4;
    };
    struct {
        unsigned T10CKPS0               :1;
        unsigned T10CKPS1               :1;
        unsigned                        :1;
        unsigned T10OUTPS0              :1;
        unsigned T10OUTPS1              :1;
        unsigned T10OUTPS2              :1;
        unsigned T10OUTPS3              :1;
    };
} T10CONbits_t;
extern volatile T10CONbits_t T10CONbits __at(0xF33);
// bitfield macros
#define _T10CON_T10CKPS_POSN                                0x0
#define _T10CON_T10CKPS_POSITION                            0x0
#define _T10CON_T10CKPS_SIZE                                0x2
#define _T10CON_T10CKPS_LENGTH                              0x2
#define _T10CON_T10CKPS_MASK                                0x3
#define _T10CON_TMR10ON_POSN                                0x2
#define _T10CON_TMR10ON_POSITION                            0x2
#define _T10CON_TMR10ON_SIZE                                0x1
#define _T10CON_TMR10ON_LENGTH                              0x1
#define _T10CON_TMR10ON_MASK                                0x4
#define _T10CON_T10OUTPS_POSN                               0x3
#define _T10CON_T10OUTPS_POSITION                           0x3
#define _T10CON_T10OUTPS_SIZE                               0x4
#define _T10CON_T10OUTPS_LENGTH                             0x4
#define _T10CON_T10OUTPS_MASK                               0x78
#define _T10CON_T10CKPS0_POSN                               0x0
#define _T10CON_T10CKPS0_POSITION                           0x0
#define _T10CON_T10CKPS0_SIZE                               0x1
#define _T10CON_T10CKPS0_LENGTH                             0x1
#define _T10CON_T10CKPS0_MASK                               0x1
#define _T10CON_T10CKPS1_POSN                               0x1
#define _T10CON_T10CKPS1_POSITION                           0x1
#define _T10CON_T10CKPS1_SIZE                               0x1
#define _T10CON_T10CKPS1_LENGTH                             0x1
#define _T10CON_T10CKPS1_MASK                               0x2
#define _T10CON_T10OUTPS0_POSN                              0x3
#define _T10CON_T10OUTPS0_POSITION                          0x3
#define _T10CON_T10OUTPS0_SIZE                              0x1
#define _T10CON_T10OUTPS0_LENGTH                            0x1
#define _T10CON_T10OUTPS0_MASK                              0x8
#define _T10CON_T10OUTPS1_POSN                              0x4
#define _T10CON_T10OUTPS1_POSITION                          0x4
#define _T10CON_T10OUTPS1_SIZE                              0x1
#define _T10CON_T10OUTPS1_LENGTH                            0x1
#define _T10CON_T10OUTPS1_MASK                              0x10
#define _T10CON_T10OUTPS2_POSN                              0x5
#define _T10CON_T10OUTPS2_POSITION                          0x5
#define _T10CON_T10OUTPS2_SIZE                              0x1
#define _T10CON_T10OUTPS2_LENGTH                            0x1
#define _T10CON_T10OUTPS2_MASK                              0x20
#define _T10CON_T10OUTPS3_POSN                              0x6
#define _T10CON_T10OUTPS3_POSITION                          0x6
#define _T10CON_T10OUTPS3_SIZE                              0x1
#define _T10CON_T10OUTPS3_LENGTH                            0x1
#define _T10CON_T10OUTPS3_MASK                              0x40

// Register: PR10
#define PR10 PR10
extern volatile unsigned char           PR10                __at(0xF34);
#ifndef _LIB_BUILD
asm("PR10 equ 0F34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR10                   :8;
    };
} PR10bits_t;
extern volatile PR10bits_t PR10bits __at(0xF34);
// bitfield macros
#define _PR10_PR10_POSN                                     0x0
#define _PR10_PR10_POSITION                                 0x0
#define _PR10_PR10_SIZE                                     0x8
#define _PR10_PR10_LENGTH                                   0x8
#define _PR10_PR10_MASK                                     0xFF

// Register: TMR10
#define TMR10 TMR10
extern volatile unsigned char           TMR10               __at(0xF35);
#ifndef _LIB_BUILD
asm("TMR10 equ 0F35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR10                  :8;
    };
} TMR10bits_t;
extern volatile TMR10bits_t TMR10bits __at(0xF35);
// bitfield macros
#define _TMR10_TMR10_POSN                                   0x0
#define _TMR10_TMR10_POSITION                               0x0
#define _TMR10_TMR10_SIZE                                   0x8
#define _TMR10_TMR10_LENGTH                                 0x8
#define _TMR10_TMR10_MASK                                   0xFF

// Register: T8CON
#define T8CON T8CON
extern volatile unsigned char           T8CON               __at(0xF36);
#ifndef _LIB_BUILD
asm("T8CON equ 0F36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T8CKPS                 :2;
        unsigned TMR8ON                 :1;
        unsigned T8OUTPS                :4;
    };
    struct {
        unsigned T8CKPS0                :1;
        unsigned T8CKPS1                :1;
        unsigned                        :1;
        unsigned T8OUTPS0               :1;
        unsigned T8OUTPS1               :1;
        unsigned T8OUTPS2               :1;
        unsigned T8OUTPS3               :1;
    };
} T8CONbits_t;
