MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
extern volatile TMR6bits_t TMR6bits __at(0xF3B);
// bitfield macros
#define _TMR6_TMR6_POSN                                     0x0
#define _TMR6_TMR6_POSITION                                 0x0
#define _TMR6_TMR6_SIZE                                     0x8
#define _TMR6_TMR6_LENGTH                                   0x8
#define _TMR6_TMR6_MASK                                     0xFF

// Register: T7GCON
#define T7GCON T7GCON
extern volatile unsigned char           T7GCON              __at(0xF3C);
#ifndef _LIB_BUILD
asm("T7GCON equ 0F3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned T7GGO_NOT_T7DONE       :1;
    };
    struct {
        unsigned T7GSS                  :2;
        unsigned T7GVAL                 :1;
        unsigned T7GGO_nT7DONE          :1;
        unsigned T7GSPM                 :1;
        unsigned T7GTM                  :1;
        unsigned T7GPOL                 :1;
        unsigned TMR7GE                 :1;
    };
    struct {
        unsigned T7GSS0                 :1;
        unsigned T7GSS1                 :1;
        unsigned                        :1;
        unsigned T7GGO                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T7DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned nT7DONE                :1;
    };
} T7GCONbits_t;
extern volatile T7GCONbits_t T7GCONbits __at(0xF3C);
// bitfield macros
#define _T7GCON_T7GGO_NOT_T7DONE_POSN                       0x3
#define _T7GCON_T7GGO_NOT_T7DONE_POSITION                   0x3
#define _T7GCON_T7GGO_NOT_T7DONE_SIZE                       0x1
#define _T7GCON_T7GGO_NOT_T7DONE_LENGTH                     0x1
#define _T7GCON_T7GGO_NOT_T7DONE_MASK                       0x8
#define _T7GCON_T7GSS_POSN                                  0x0
#define _T7GCON_T7GSS_POSITION                              0x0
#define _T7GCON_T7GSS_SIZE                                  0x2
#define _T7GCON_T7GSS_LENGTH                                0x2
#define _T7GCON_T7GSS_MASK                                  0x3
#define _T7GCON_T7GVAL_POSN                                 0x2
#define _T7GCON_T7GVAL_POSITION                             0x2
#define _T7GCON_T7GVAL_SIZE                                 0x1
#define _T7GCON_T7GVAL_LENGTH                               0x1
#define _T7GCON_T7GVAL_MASK                                 0x4
#define _T7GCON_T7GGO_nT7DONE_POSN                          0x3
#define _T7GCON_T7GGO_nT7DONE_POSITION                      0x3
#define _T7GCON_T7GGO_nT7DONE_SIZE                          0x1
#define _T7GCON_T7GGO_nT7DONE_LENGTH                        0x1
#define _T7GCON_T7GGO_nT7DONE_MASK                          0x8
#define _T7GCON_T7GSPM_POSN                                 0x4
#define _T7GCON_T7GSPM_POSITION                             0x4
#define _T7GCON_T7GSPM_SIZE                                 0x1
#define _T7GCON_T7GSPM_LENGTH                               0x1
#define _T7GCON_T7GSPM_MASK                                 0x10
#define _T7GCON_T7GTM_POSN                                  0x5
#define _T7GCON_T7GTM_POSITION                              0x5
#define _T7GCON_T7GTM_SIZE                                  0x1
#define _T7GCON_T7GTM_LENGTH                                0x1
#define _T7GCON_T7GTM_MASK                                  0x20
#define _T7GCON_T7GPOL_POSN                                 0x6
#define _T7GCON_T7GPOL_POSITION                             0x6
#define _T7GCON_T7GPOL_SIZE                                 0x1
#define _T7GCON_T7GPOL_LENGTH                               0x1
#define _T7GCON_T7GPOL_MASK                                 0x40
#define _T7GCON_TMR7GE_POSN                                 0x7
#define _T7GCON_TMR7GE_POSITION                             0x7
#define _T7GCON_TMR7GE_SIZE                                 0x1
#define _T7GCON_TMR7GE_LENGTH                               0x1
#define _T7GCON_TMR7GE_MASK                                 0x80
#define _T7GCON_T7GSS0_POSN                                 0x0
#define _T7GCON_T7GSS0_POSITION                             0x0
#define _T7GCON_T7GSS0_SIZE                                 0x1
#define _T7GCON_T7GSS0_LENGTH                               0x1
#define _T7GCON_T7GSS0_MASK                                 0x1
#define _T7GCON_T7GSS1_POSN                                 0x1
#define _T7GCON_T7GSS1_POSITION                             0x1
#define _T7GCON_T7GSS1_SIZE                                 0x1
#define _T7GCON_T7GSS1_LENGTH                               0x1
#define _T7GCON_T7GSS1_MASK                                 0x2
#define _T7GCON_T7GGO_POSN                                  0x3
#define _T7GCON_T7GGO_POSITION                              0x3
#define _T7GCON_T7GGO_SIZE                                  0x1
#define _T7GCON_T7GGO_LENGTH                                0x1
#define _T7GCON_T7GGO_MASK                                  0x8
#define _T7GCON_NOT_T7DONE_POSN                             0x3
#define _T7GCON_NOT_T7DONE_POSITION                         0x3
#define _T7GCON_NOT_T7DONE_SIZE                             0x1
#define _T7GCON_NOT_T7DONE_LENGTH                           0x1
#define _T7GCON_NOT_T7DONE_MASK                             0x8
#define _T7GCON_nT7DONE_POSN                                0x3
#define _T7GCON_nT7DONE_POSITION                            0x3
#define _T7GCON_nT7DONE_SIZE                                0x1
#define _T7GCON_nT7DONE_LENGTH                              0x1
#define _T7GCON_nT7DONE_MASK                                0x8

// Register: T7CON
#define T7CON T7CON
extern volatile unsigned char           T7CON               __at(0xF3D);
#ifndef _LIB_BUILD
asm("T7CON equ 0F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned NOT_T7SYNC             :1;
    };
    struct {
        unsigned TMR7ON                 :1;
        unsigned RD16                   :1;
        unsigned nT7SYNC                :1;
        unsigned SOSCEN                 :1;
        unsigned T7CKPS                 :2;
        unsigned TMR7CS                 :2;
    };
    struct {
        unsigned                        :4;
        unsigned T7CKPS0                :1;
        unsigned T7CKPS1                :1;
        unsigned TMR7CS0                :1;
        unsigned TMR7CS1                :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD167                  :1;
        unsigned                        :1;
        unsigned SOSCEN7                :1;
    };
} T7CONbits_t;
