MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
// Register: TMR7H
#define TMR7H TMR7H
extern volatile unsigned char           TMR7H               __at(0xF3F);
#ifndef _LIB_BUILD
asm("TMR7H equ 0F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR7H                  :8;
    };
} TMR7Hbits_t;
extern volatile TMR7Hbits_t TMR7Hbits __at(0xF3F);
// bitfield macros
#define _TMR7H_TMR7H_POSN                                   0x0
#define _TMR7H_TMR7H_POSITION                               0x0
#define _TMR7H_TMR7H_SIZE                                   0x8
#define _TMR7H_TMR7H_LENGTH                                 0x8
#define _TMR7H_TMR7H_MASK                                   0xFF

// Register: CCP10CON
#define CCP10CON CCP10CON
extern volatile unsigned char           CCP10CON            __at(0xF40);
#ifndef _LIB_BUILD
asm("CCP10CON equ 0F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP10M                 :4;
        unsigned DC10B                  :2;
    };
    struct {
        unsigned CCP10M0                :1;
        unsigned CCP10M1                :1;
        unsigned CCP10M2                :1;
        unsigned CCP10M3                :1;
        unsigned DC10B0                 :1;
        unsigned DC10B1                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CCP10Y                 :1;
        unsigned CCP10X                 :1;
    };
} CCP10CONbits_t;
extern volatile CCP10CONbits_t CCP10CONbits __at(0xF40);
// bitfield macros
#define _CCP10CON_CCP10M_POSN                               0x0
#define _CCP10CON_CCP10M_POSITION                           0x0
#define _CCP10CON_CCP10M_SIZE                               0x4
#define _CCP10CON_CCP10M_LENGTH                             0x4
#define _CCP10CON_CCP10M_MASK                               0xF
#define _CCP10CON_DC10B_POSN                                0x4
#define _CCP10CON_DC10B_POSITION                            0x4
#define _CCP10CON_DC10B_SIZE                                0x2
#define _CCP10CON_DC10B_LENGTH                              0x2
#define _CCP10CON_DC10B_MASK                                0x30
#define _CCP10CON_CCP10M0_POSN                              0x0
#define _CCP10CON_CCP10M0_POSITION                          0x0
#define _CCP10CON_CCP10M0_SIZE                              0x1
#define _CCP10CON_CCP10M0_LENGTH                            0x1
#define _CCP10CON_CCP10M0_MASK                              0x1
#define _CCP10CON_CCP10M1_POSN                              0x1
#define _CCP10CON_CCP10M1_POSITION                          0x1
#define _CCP10CON_CCP10M1_SIZE                              0x1
#define _CCP10CON_CCP10M1_LENGTH                            0x1
#define _CCP10CON_CCP10M1_MASK                              0x2
#define _CCP10CON_CCP10M2_POSN                              0x2
#define _CCP10CON_CCP10M2_POSITION                          0x2
#define _CCP10CON_CCP10M2_SIZE                              0x1
#define _CCP10CON_CCP10M2_LENGTH                            0x1
#define _CCP10CON_CCP10M2_MASK                              0x4
#define _CCP10CON_CCP10M3_POSN                              0x3
#define _CCP10CON_CCP10M3_POSITION                          0x3
#define _CCP10CON_CCP10M3_SIZE                              0x1
#define _CCP10CON_CCP10M3_LENGTH                            0x1
#define _CCP10CON_CCP10M3_MASK                              0x8
#define _CCP10CON_DC10B0_POSN                               0x4
#define _CCP10CON_DC10B0_POSITION                           0x4
#define _CCP10CON_DC10B0_SIZE                               0x1
#define _CCP10CON_DC10B0_LENGTH                             0x1
#define _CCP10CON_DC10B0_MASK                               0x10
#define _CCP10CON_DC10B1_POSN                               0x5
#define _CCP10CON_DC10B1_POSITION                           0x5
#define _CCP10CON_DC10B1_SIZE                               0x1
#define _CCP10CON_DC10B1_LENGTH                             0x1
#define _CCP10CON_DC10B1_MASK                               0x20
#define _CCP10CON_CCP10Y_POSN                               0x4
#define _CCP10CON_CCP10Y_POSITION                           0x4
#define _CCP10CON_CCP10Y_SIZE                               0x1
#define _CCP10CON_CCP10Y_LENGTH                             0x1
#define _CCP10CON_CCP10Y_MASK                               0x10
#define _CCP10CON_CCP10X_POSN                               0x5
#define _CCP10CON_CCP10X_POSITION                           0x5
#define _CCP10CON_CCP10X_SIZE                               0x1
#define _CCP10CON_CCP10X_LENGTH                             0x1
#define _CCP10CON_CCP10X_MASK                               0x20

// Register: CCPR10
#define CCPR10 CCPR10
extern volatile unsigned short          CCPR10              __at(0xF41);
#ifndef _LIB_BUILD
asm("CCPR10 equ 0F41h");
#endif

// Register: CCPR10L
#define CCPR10L CCPR10L
extern volatile unsigned char           CCPR10L             __at(0xF41);
#ifndef _LIB_BUILD
asm("CCPR10L equ 0F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10L                :8;
    };
} CCPR10Lbits_t;
extern volatile CCPR10Lbits_t CCPR10Lbits __at(0xF41);
// bitfield macros
#define _CCPR10L_CCPR10L_POSN                               0x0
#define _CCPR10L_CCPR10L_POSITION                           0x0
#define _CCPR10L_CCPR10L_SIZE                               0x8
#define _CCPR10L_CCPR10L_LENGTH                             0x8
#define _CCPR10L_CCPR10L_MASK                               0xFF

// Register: CCPR10H
#define CCPR10H CCPR10H
extern volatile unsigned char           CCPR10H             __at(0xF42);
#ifndef _LIB_BUILD
asm("CCPR10H equ 0F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10H                :8;
    };
} CCPR10Hbits_t;
extern volatile CCPR10Hbits_t CCPR10Hbits __at(0xF42);
// bitfield macros
#define _CCPR10H_CCPR10H_POSN                               0x0
#define _CCPR10H_CCPR10H_POSITION                           0x0
#define _CCPR10H_CCPR10H_SIZE                               0x8
#define _CCPR10H_CCPR10H_LENGTH                             0x8
#define _CCPR10H_CCPR10H_MASK                               0xFF

