MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PMD0<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD0,7)
// ODCON2<CCP3OD>
extern volatile __bit                   CCP3OD              __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 CCP3OD_bit          _BIT_ACCESS(ODCON2,0)
// PORTG<CCP4>
extern volatile __bit                   CCP4                __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 CCP4_bit            _BIT_ACCESS(PORTG,3)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMD3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD3,1)
// ODCON2<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON2,1)
// CCP4CON<CCP4X>
extern volatile __bit                   CCP4X               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 CCP4X_bit           _BIT_ACCESS(CCP4CON,5)
// CCP4CON<CCP4Y>
extern volatile __bit                   CCP4Y               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 CCP4Y_bit           _BIT_ACCESS(CCP4CON,4)
// PORTG<CCP5>
extern volatile __bit                   CCP5                __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 CCP5_bit            _BIT_ACCESS(PORTG,4)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMD3<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD3,2)
// ODCON2<CCP5OD>
extern volatile __bit                   CCP5OD              __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 CCP5OD_bit          _BIT_ACCESS(ODCON2,2)
// CCP5CON<CCP5X>
extern volatile __bit                   CCP5X               __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 CCP5X_bit           _BIT_ACCESS(CCP5CON,5)
// CCP5CON<CCP5Y>
extern volatile __bit                   CCP5Y               __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 CCP5Y_bit           _BIT_ACCESS(CCP5CON,4)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PIE4<CCP6IE>
extern volatile __bit                   CCP6IE              __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 CCP6IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CCP6IF>
extern volatile __bit                   CCP6IF              __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 CCP6IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<CCP6IP>
extern volatile __bit                   CCP6IP              __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 CCP6IP_bit          _BIT_ACCESS(IPR4,3)
// CCP6CON<CCP6M0>
extern volatile __bit                   CCP6M0              __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 CCP6M0_bit          _BIT_ACCESS(CCP6CON,0)
// CCP6CON<CCP6M1>
extern volatile __bit                   CCP6M1              __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 CCP6M1_bit          _BIT_ACCESS(CCP6CON,1)
// CCP6CON<CCP6M2>
extern volatile __bit                   CCP6M2              __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 CCP6M2_bit          _BIT_ACCESS(CCP6CON,2)
// CCP6CON<CCP6M3>
extern volatile __bit                   CCP6M3              __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 CCP6M3_bit          _BIT_ACCESS(CCP6CON,3)
// PMD3<CCP6MD>
extern volatile __bit                   CCP6MD              __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 CCP6MD_bit          _BIT_ACCESS(PMD3,3)
// ODCON2<CCP6OD>
extern volatile __bit                   CCP6OD              __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 CCP6OD_bit          _BIT_ACCESS(ODCON2,3)
// CCP6CON<CCP6X>
extern volatile __bit                   CCP6X               __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 CCP6X_bit           _BIT_ACCESS(CCP6CON,5)
// CCP6CON<CCP6Y>
extern volatile __bit                   CCP6Y               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 CCP6Y_bit           _BIT_ACCESS(CCP6CON,4)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PIE4<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CCP7IP>
extern volatile __bit                   CCP7IP              __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 CCP7IP_bit          _BIT_ACCESS(IPR4,4)
// CCP7CON<CCP7M0>
extern volatile __bit                   CCP7M0              __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 CCP7M0_bit          _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7M1>
extern volatile __bit                   CCP7M1              __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 CCP7M1_bit          _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7M2>
extern volatile __bit                   CCP7M2              __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 CCP7M2_bit          _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7M3>
extern volatile __bit                   CCP7M3              __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 CCP7M3_bit          _BIT_ACCESS(CCP7CON,3)
// PMD3<CCP7MD>
extern volatile __bit                   CCP7MD              __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 CCP7MD_bit          _BIT_ACCESS(PMD3,4)
// ODCON2<CCP7OD>
extern volatile __bit                   CCP7OD              __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 CCP7OD_bit          _BIT_ACCESS(ODCON2,4)
// CCP7CON<CCP7X>
extern volatile __bit                   CCP7X               __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 CCP7X_bit           _BIT_ACCESS(CCP7CON,5)
// CCP7CON<CCP7Y>
extern volatile __bit                   CCP7Y               __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 CCP7Y_bit           _BIT_ACCESS(CCP7CON,4)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PIE4<CCP8IE>
extern volatile __bit                   CCP8IE              __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CCP8IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CCP8IF>
extern volatile __bit                   CCP8IF              __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 CCP8IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CCP8IP>
extern volatile __bit                   CCP8IP              __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 CCP8IP_bit          _BIT_ACCESS(IPR4,5)
// CCP8CON<CCP8M0>
extern volatile __bit                   CCP8M0              __at(0x7A30);	// @ (0xF46 * 8 + 0)
#define                                 CCP8M0_bit          _BIT_ACCESS(CCP8CON,0)
// CCP8CON<CCP8M1>
extern volatile __bit                   CCP8M1              __at(0x7A31);	// @ (0xF46 * 8 + 1)
#define                                 CCP8M1_bit          _BIT_ACCESS(CCP8CON,1)
// CCP8CON<CCP8M2>
extern volatile __bit                   CCP8M2              __at(0x7A32);	// @ (0xF46 * 8 + 2)
#define                                 CCP8M2_bit          _BIT_ACCESS(CCP8CON,2)
// CCP8CON<CCP8M3>
extern volatile __bit                   CCP8M3              __at(0x7A33);	// @ (0xF46 * 8 + 3)
#define                                 CCP8M3_bit          _BIT_ACCESS(CCP8CON,3)
// PMD3<CCP8MD>
extern volatile __bit                   CCP8MD              __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 CCP8MD_bit          _BIT_ACCESS(PMD3,5)
// ODCON2<CCP8OD>
extern volatile __bit                   CCP8OD              __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 CCP8OD_bit          _BIT_ACCESS(ODCON2,5)
// CCP8CON<CCP8X>
extern volatile __bit                   CCP8X               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 CCP8X_bit           _BIT_ACCESS(CCP8CON,5)
// CCP8CON<CCP8Y>
extern volatile __bit                   CCP8Y               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 CCP8Y_bit           _BIT_ACCESS(CCP8CON,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// PIE4<CCP9IE>
extern volatile __bit                   CCP9IE              __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 CCP9IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CCP9IF>
extern volatile __bit                   CCP9IF              __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 CCP9IF_bit          _BIT_ACCESS(PIR4,6)
// IPR4<CCP9IP>
extern volatile __bit                   CCP9IP              __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 CCP9IP_bit          _BIT_ACCESS(IPR4,6)
// CCP9CON<CCP9M0>
extern volatile __bit                   CCP9M0              __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 CCP9M0_bit          _BIT_ACCESS(CCP9CON,0)
// CCP9CON<CCP9M1>
extern volatile __bit                   CCP9M1              __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 CCP9M1_bit          _BIT_ACCESS(CCP9CON,1)
// CCP9CON<CCP9M2>
extern volatile __bit                   CCP9M2              __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 CCP9M2_bit          _BIT_ACCESS(CCP9CON,2)
// CCP9CON<CCP9M3>
extern volatile __bit                   CCP9M3              __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 CCP9M3_bit          _BIT_ACCESS(CCP9CON,3)
// PMD3<CCP9MD>
extern volatile __bit                   CCP9MD              __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 CCP9MD_bit          _BIT_ACCESS(PMD3,6)
// ODCON2<CCP9OD>
extern volatile __bit                   CCP9OD              __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 CCP9OD_bit          _BIT_ACCESS(ODCON2,6)
// CCP9CON<CCP9X>
extern volatile __bit                   CCP9X               __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 CCP9X_bit           _BIT_ACCESS(CCP9CON,5)
// CCP9CON<CCP9Y>
extern volatile __bit                   CCP9Y               __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 CCP9Y_bit           _BIT_ACCESS(CCP9CON,4)
// PORTJ<CE>
extern volatile __bit                   CE                  __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 CE_bit              _BIT_ACCESS(PORTJ,5)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON1<CHSN0>
extern volatile __bit                   CHSN0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 CHSN0_bit           _BIT_ACCESS(ADCON1,0)
// ADCON1<CHSN1>
extern volatile __bit                   CHSN1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 CHSN1_bit           _BIT_ACCESS(ADCON1,1)
// ADCON1<CHSN2>
extern volatile __bit                   CHSN2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 CHSN2_bit           _BIT_ACCESS(ADCON1,2)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// PORTG<CK2>
extern volatile __bit                   CK2                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 CK2_bit             _BIT_ACCESS(PORTG,1)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE6<CMP1IE>
extern volatile __bit                   CMP1IE              __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 CMP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CMP1IF>
extern volatile __bit                   CMP1IF              __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 CMP1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<CMP1IP>
extern volatile __bit                   CMP1IP              __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 CMP1IP_bit          _BIT_ACCESS(IPR6,0)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,0)
// CMSTAT<CMP1OUT>
extern volatile __bit                   CMP1OUT             __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CMP1OUT_bit         _BIT_ACCESS(CMSTAT,5)
// PIE6<CMP2IE>
extern volatile __bit                   CMP2IE              __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 CMP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CMP2IF>
extern volatile __bit                   CMP2IF              __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 CMP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CMP2IP>
extern volatile __bit                   CMP2IP              __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 CMP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,1)
// CMSTAT<CMP2OUT>
extern volatile __bit                   CMP2OUT             __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 CMP2OUT_bit         _BIT_ACCESS(CMSTAT,6)
// PIE6<CMP3IE>
extern volatile __bit                   CMP3IE              __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 CMP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CMP3IF>
extern volatile __bit                   CMP3IF              __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 CMP3IF_bit          _BIT_ACCESS(PIR6,2)
// IPR6<CMP3IP>
extern volatile __bit                   CMP3IP              __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 CMP3IP_bit          _BIT_ACCESS(IPR6,2)
// PMD2<CMP3MD>
extern volatile __bit                   CMP3MD              __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 CMP3MD_bit          _BIT_ACCESS(PMD2,2)
// CMSTAT<CMP3OUT>
extern volatile __bit                   CMP3OUT             __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 CMP3OUT_bit         _BIT_ACCESS(CMSTAT,7)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR3CON<CMPL03>
extern volatile __bit                   CMPL03              __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 CMPL03_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// PSTR3CON<CMPL13>
extern volatile __bit                   CMPL13              __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 CMPL13_bit          _BIT_ACCESS(PSTR3CON,7)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
