MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K22/mcu.h
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5GCON<nT5DONE>
extern volatile __bit                   nT5DONE             __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 nT5DONE_bit         _BIT_ACCESS(T5GCON,3)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// T7GCON<nT7DONE>
extern volatile __bit                   nT7DONE             __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 nT7DONE_bit         _BIT_ACCESS(T7GCON,3)
// T7CON<nT7SYNC>
extern volatile __bit                   nT7SYNC             __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 nT7SYNC_bit         _BIT_ACCESS(T7CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// TXSTA1<nTX8>
extern volatile __bit                   nTX8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nTX8_bit            _BIT_ACCESS(TXSTA1,6)
// SSP2STAT<nW2>
extern volatile __bit                   nW2                 __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 nW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PORTE<nWR>
extern volatile __bit                   nWR                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 nWR_bit             _BIT_ACCESS(PORTE,1)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC18F86K22_H_
